sca-secure-library-sca25519/sca25519/STM32F407-static/crypto/scalarmult/scalarmult_25519.c
#include "../include/fe25519.h"
#include "../include/sc25519.h"
#include "../include/randombytes.h"
#include "../include/crypto_scalarmult.h"
#include "../../stm32wrapper.h"

#define MULTIPLICATIVE_CSWAP
#define ITOH_COUNTERMEASURE
#define ITOH_COUNTERMEASURE64

//is the key updatable with respect to randomization - by default no
//static uint8_t updatable = 1;
//static uint8_t fixed = 0;
#define UPDATABLE_STATIC_SCALAR
#define SCALAR_RANDOMIZATION

typedef struct _ST_curve25519ladderstepWorkingState
{
    // The base point in affine coordinates
    fe25519 x0;

    // The two working points p, q, in projective coordinates. Possibly randomized.
    fe25519 xp;
    fe25519 zp;
    fe25519 xq;
    fe25519 zq;

    UN_256bitValue r;
    UN_256bitValue s;

    int nextScalarBitToProcess;
    uint8_t previousProcessedBit;

} ST_curve25519ladderstepWorkingState;

typedef struct
{
    fe25519* x;
    fe25519* y;
    fe25519* z;
} point25519;

extern void curve25519_cswap_asm(ST_curve25519ladderstepWorkingState* state, uint32_t* b);

#define ROTATE16(a) { a = (((uint32_t) a) >> 16) | (a << 16); }

#define HAS_ASM_cSwapAndRandomize_asm

#ifdef HAS_ASM_cSwapAndRandomize_asm
extern void cSwapAndRandomize_asm (
                        uint32_t swapData,
                        uint32_t *pFe1,
                        uint32_t *pFe2,
                        uint32_t randomVal);

// let the subsequent code call the assembly function instead of the C function.
#define cSwapAndRandomize cSwapAndRandomize_asm

#else // #ifdef HAS_ASM_cSwapAndRandomize_asm

/// swapData is expected to contain the swap status bit in bit #0
/// and fresh random data in bits #1 to #31.
/// pFe1 and pFe2 contain the pointers to the input field elements.
///
/// conditionally swaps the field elements and replaces them
/// with a random multiple.
/// Reduces the result "on-the-fly".
///
static void cSwapAndRandomize (
                        uint32_t swapData,
                        uint32_t *pFe1,
                        uint32_t *pFe2,
                        uint32_t randomVal)
{
   // we will implement the conditional move half-word wise by
   // generating two values with the swapBit in bit #0 and random
   // data in the upper half-word.
  
   uint32_t mpyMask1;
   uint32_t mpyMask2;

   // clip the randomized multipliers to 31 bits, such that during 
   // reduction the result value may not overflow.
   // also clear bit #15
   uint32_t randomize_mpy = randomVal;

   // Make sure that the randomization multipliers are nonzero. 
   randomize_mpy |= 1;

   // generate the "swap-multipliers".
   {
      mpyMask2 = (randomize_mpy ^ swapData) & 0xffff0001; 
      mpyMask1 = swapData & 0xffff0001;
   }

   // mpyMask1 and 2 contain in bit #0 the swap status and its complement.
   // bits #1 ... 15 are zero
   // bits #16 to 31 contain random data.

   randomize_mpy &= 0x7fff7fff;


   uint32_t in1, in2;
   
   // First handle word #7

   in1 = pFe1[7];
   in2 = pFe2[7];
   
   uint32_t outA, outB;

   // conditionally swap the lower 16 bits. 
   // the content of the upper 16 bits will be undefined.
   outA = in1 * mpyMask2 + in2 * mpyMask1;
   outB = in1 * mpyMask1 + in2 * mpyMask2;
   
   // The least significant 16 bits now contain the swapped content of
   // the most significant half-word of the input field elements
   // The upper part contains random values.

   outA &= 0xffff; 
   outB &= 0xffff; 
   
   uint64_t scaledA, scaledB;
   ROTATE16 (randomize_mpy); scaledA = ((uint64_t) randomize_mpy) * outA;
   ROTATE16 (randomize_mpy); scaledB = ((uint64_t) randomize_mpy) * outB;

   ROTATE16 (in1);
   ROTATE16 (in2);

   // conditionally swap the lower 16 bits. 
   // the content of the upper 16 bits will be undefined.
   outA = in1 * mpyMask2 + in2 * mpyMask1;
   outB = in1 * mpyMask1 + in2 * mpyMask2;

   outA <<= 16; 
   outB <<= 16; 

   ROTATE16 (randomize_mpy); scaledA +=  ((uint64_t) randomize_mpy) * outA;
   ROTATE16 (randomize_mpy); scaledB +=  ((uint64_t) randomize_mpy) * outB;

   pFe1[7] = ((uint32_t) scaledA) & 0x7fffffff;
   pFe2[7] = ((uint32_t) scaledB) & 0x7fffffff;

   // reduce the upper bits of the result.
   scaledA >>= 31;
   scaledB >>= 31;
   scaledA = 19 * ((uint64_t) ((uint32_t) scaledA));
   scaledB = 19 * ((uint64_t) ((uint32_t) scaledB));

   // now handle the remaining words.
   int i;
   for (i = 0; i < 7; i ++)
   {
      in1 = pFe1[i];
      in2 = pFe2[i];
  
      // handle the lower 16 bits of the two input words i
 
      outA = in1 * mpyMask2 + in2 * mpyMask1;
      outB = in1 * mpyMask1 + in2 * mpyMask2;
      outA &= 0xffff; 
      outB &= 0xffff; 
    
      ROTATE16 (randomize_mpy); scaledA += ((uint64_t) randomize_mpy) * outA;
      ROTATE16 (randomize_mpy); scaledB += ((uint64_t) randomize_mpy) * outB;
 
      // handle the upper 16 bits of the two input words i

      // first move the lower bits to the upper half and vice-versa.
      ROTATE16 (in1);
      ROTATE16 (in2);

      outA = in1 * mpyMask2 + in2 * mpyMask1;
      outB = in1 * mpyMask1 + in2 * mpyMask2;

      outA <<= 16;
      outB <<= 16;
 
      ROTATE16 (randomize_mpy); scaledA += ((uint64_t) randomize_mpy) * outA;
      ROTATE16 (randomize_mpy); scaledB += ((uint64_t) randomize_mpy) * outB;
    
      // write back the results. 
      pFe1[i] = (uint32_t) scaledA;
      pFe2[i] = (uint32_t) scaledB;
 
      scaledA >>= 32;
      scaledB >>= 32;
   }

   // deal with the last carries for word #7
   scaledA += pFe1[7];
   scaledB += pFe2[7];

   pFe1[7] = (uint32_t) scaledA;
   pFe2[7] = (uint32_t) scaledB;
}

#endif // #ifdef HAS_ASM_cSwapAndRandomize_asm

#define ROTATER(a,cnt) { a = (((uint32_t) a) >> cnt) | (a << (32 - cnt)); }

static void maskScalarBitsWithRandomAndCswap(
      ST_curve25519ladderstepWorkingState *pState,
      uint32_t wordWithConditionBit,
      uint32_t bitNumber) 
{ 
    uint32_t randomDataBuffer[2] = {0,0};
    randombytes (randomDataBuffer, sizeof(randomDataBuffer));
    //
    // first combine the scalar bit with a random value which has
    // the bit at the data position cleared
    uint32_t mask = randomDataBuffer[0] & (~(1 << bitNumber));
    wordWithConditionBit ^= mask;

    // Arrange for having the condition bit at bit #0 and random data elsewhere.
    ROTATER(wordWithConditionBit, bitNumber);

    cSwapAndRandomize (wordWithConditionBit, 
                       pState->xp.as_uint32_t, pState->xq.as_uint32_t, 
                       randomDataBuffer[1]);
    cSwapAndRandomize (wordWithConditionBit, 
                       pState->zp.as_uint32_t, pState->zq.as_uint32_t, 
                       randomDataBuffer[1]);
}

static void
curve25519_ladderstep(
    ST_curve25519ladderstepWorkingState* pState
);

void
curve25519_ladderstep(
    ST_curve25519ladderstepWorkingState* pState
)
{
    // Implements the "ladd-1987-m-3" differential-addition-and-doubling formulas
    // Source: 1987 Montgomery "Speeding the Pollard and elliptic curve methods of factorization", page 261,
    //         fifth and sixth displays, plus common-subexpression elimination.
    //
    // Notation from the explicit formulas database:
    // (X2,Z2) corresponds to (xp,zp),
    // (X3,Z3) corresponds to (xq,zq)
    // Result (X4,Z4) (X5,Z5) expected in (xp,zp) and (xq,zq)
    //
    // A = X2+Z2; AA = A^2; B = X2-Z2; BB = B^2; E = AA-BB; C = X3+Z3; D = X3-Z3;
    // DA = D*A; CB = C*B; t0 = DA+CB; t1 = t0^2; X5 = Z1*t1; t2 = DA-CB;
    // t3 = t2^2; Z5 = X1*t3; X4 = AA*BB; t4 = a24*E; t5 = BB+t4; Z4 = E*t5 ;
    //
    // Re-Ordered for using less temporaries.

    fe25519 t1, t2;

    fe25519 *b1=&pState->xp; fe25519 *b2=&pState->zp;
    fe25519 *b3=&pState->xq; fe25519 *b4=&pState->zq;

    fe25519 *b5= &t1; fe25519 *b6=&t2;

    fe25519_add(b5,b1,b2); // A = X2+Z2
    fe25519_sub(b6,b1,b2); // B = X2-Z2
    fe25519_add(b1,b3,b4); // C = X3+Z3
    fe25519_sub(b2,b3,b4); // D = X3-Z3
    fe25519_mul(b3,b2,b5); // DA= D*A
    fe25519_mul(b2,b1,b6); // CB= C*B
    fe25519_add(b1,b2,b3); // T0= DA+CB
    fe25519_sub(b4,b3,b2); // T2= DA-CB
    fe25519_square(b3,b1); // X5==T1= T0^2
    fe25519_square(b1,b4); // T3= t2^2
    fe25519_mul(b4,b1,&pState->x0); // Z5=X1*t3
    fe25519_square(b1,b5); // AA=A^2
    fe25519_square(b5,b6); // BB=B^2
    fe25519_sub(b2,b1,b5); // E=AA-BB
    fe25519_mul(b1,b5,b1); // X4= AA*BB
#ifdef CRYPTO_HAS_ASM_COMBINED_MPY121666ADD_FE25519
    fe25519_mpy121666add(b6,b5,b2);
#else
    fe25519_mpyWith121666 (b6,b2); // T4 = a24*E
    fe25519_add(b6,b6,b5); // T5 = BB + t4
#endif
    fe25519_mul(b2,b6,b2); // Z4 = E*t5
}

static const fe25519 CON486662 = {{0x06, 0x6d, 0x07, 0x00, 0x00, 0x00, 0x00, 0x00,
                                   0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
                                   0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
                                   0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00}};


