sca-secure-library-sca25519/sca25519/STM32F407-static/crypto/scalarmult/scalarmult_25519.c
static void curve25519_doublePoint(
    point25519* R,
    const point25519* P
)
{
    // x3 = 2y1z1^2 * (3x1^2z1+2ax1z1^2+z1^3)^2 - 8ay1^3z1^6 - 16x1y1^3z1^5
    // y3 = 4y1^2z1^3 * (3x1+az1) * (3x1^2z1+2ax1z1^2=z1^3) - (3x1^2z1+2ax1z1^2=z1^3)^3 - 8y1^4z1^5
    fe25519 v1, v2, v3, v4, v5, v6, v7;

    fe25519_square(&v6, P->z);
    fe25519_mul(&v6, &v6, P->y);
    fe25519_add(&v6, &v6, &v6);
    fe25519_square(&v1, P->x);
    fe25519_mul(&v1, &v1, P->z);

    fe25519_add(&v2, &v1, &v1);
    fe25519_add(&v1, &v1, &v2);
    fe25519_square(&v2, P->z);
    fe25519_mul(&v2, &v2, P->x);
    fe25519_mul(&v2, &v2, &CON486662);
    
    fe25519_add(&v2, &v2, &v2);
    fe25519_add(&v1, &v1, &v2);
    fe25519_square(&v2, P->z);
    fe25519_mul(&v2, &v2, P->z);
    fe25519_add(&v1, &v1, &v2);

    fe25519_square(&v2, &v1);
    fe25519_mul(&v6, &v6, &v2);
    fe25519_square(&v3, P->z);
    fe25519_square(&v4, &v3);
    fe25519_mul(&v4, &v4, P->z);

    fe25519_square(&v3, P->y);
    fe25519_mul(&v4, &v4, &v3);
    fe25519_mul(&v4, &v4, P->y);
    fe25519_add(&v4, &v4, &v4);
    fe25519_add(&v4, &v4, &v4);

    fe25519_add(&v4, &v4, &v4);
    fe25519_mul(&v5, &v4, P->z);
    fe25519_mul(&v5, &v5, &CON486662);
    fe25519_sub(&v6, &v6, &v5);
    fe25519_mul(&v5, &v4, P->x);
    
    fe25519_square(&v7, P->z);
    fe25519_mul(&v7, &v7, P->z);
    fe25519_mul(&v3, &v3, &v7);
    fe25519_add(&v3, &v3, &v3);
    fe25519_add(&v3, &v3, &v3);

    fe25519_mul(&v7, &CON486662, P->z);
    fe25519_add(&v7, &v7, P->x);
    fe25519_add(&v7, &v7, P->x);
    fe25519_add(&v7, &v7, P->x);
    fe25519_mul(&v7, &v7, &v3);

    fe25519_add(&v5, &v5, &v5);
    fe25519_sub(R->x, &v6, &v5);

    fe25519_mul(&v7, &v7, &v1);
    fe25519_mul(&v2, &v2, &v1);
    fe25519_sub(&v7, &v7, &v2);
    fe25519_mul(&v5, &v4, P->y);
    fe25519_sub(R->y, &v7, &v5);

    fe25519_mul(R->z, &v4, P->z);
}

static void
curve25519_addPoint(
    point25519* R,
    const point25519* P,
    const point25519* Q
)
{
    // x3 = (y2z1 - y1z2)^2 * z1z2*(x2z1 - x1z2) - (x2z1-x1z2)^3*(a*z1z2 + x1z2 + x2z1)
    // y3 = ((2*x1z2 + x2z1) + a*z1z2) * (y2z1 - y1z2) * (x1z2 - x1z2)^2 - z1z2*(y2z1 - y1z2)^3 - y1z2*(x2z1 - x1z2)^3
    // z3 = z1z2*(x2z1 - x1z2)^3

    // 16M + 3S + 10A
    fe25519 y2z1, y1z2, z1z2, x2z1, x1z2;
    fe25519 y2z1my1z2, x2z1mx1z2, x1z2px2z1;
    fe25519 AA, BB, CC, DD;

    fe25519_mul(&y2z1, Q->y, P->z);
    fe25519_mul(&y1z2, P->y, Q->z);
    fe25519_mul(&z1z2, P->z, Q->z);
    fe25519_mul(&x2z1, Q->x, P->z);
    fe25519_mul(&x1z2, P->x, Q->z);

    fe25519_sub(&y2z1my1z2, &y2z1, &y1z2);
    fe25519_sub(&x2z1mx1z2, &x2z1, &x1z2);
    fe25519_add(&x1z2px2z1, &x1z2, &x2z1);

    fe25519_square(&AA, &y2z1my1z2);
    fe25519_mul(&AA, &AA, &x2z1mx1z2);
    fe25519_mul(&AA, &AA, &z1z2);

    fe25519_mul(&BB, &CON486662, &z1z2);
    fe25519_add(&CC, &x1z2px2z1, &x1z2);
    fe25519_add(&CC, &CC, &BB);

    fe25519_square(&DD, &x2z1mx1z2);
    fe25519_mul(&x2z1mx1z2, &DD, &x2z1mx1z2);
    fe25519_mul(&DD, &DD, &y2z1my1z2);
    fe25519_mul(&DD, &DD, &CC);

    fe25519_add(&BB, &BB, &x2z1);
    fe25519_add(&BB, &BB, &x1z2);
    fe25519_mul(&BB, &BB, &x2z1mx1z2);

    fe25519_sub(R->x, &AA, &BB);

    fe25519_square(&AA, &y2z1my1z2);
    fe25519_mul(&AA, &AA, &y2z1my1z2);
    fe25519_mul(&AA, &AA, &z1z2);
    fe25519_sub(R->y, &DD, &AA);
    fe25519_mul(&AA, &y1z2, &x2z1mx1z2);
    fe25519_sub(R->y, R->y, &AA);

    fe25519_mul(R->z, &z1z2, &x2z1mx1z2);
}

// Montgomery y-recovery Algorithm 5 in Montgomery Curves and their arithmetic
static void
computeY_curve25519_projective
(
    fe25519* y1,
    fe25519* x1, fe25519* z1, // (x1,z1) = k*P
    const fe25519* x2, const fe25519* z2, // (x2,z2)= (k+1)*P
    const fe25519* x,  const fe25519* y   // (x,y) = P, z=1
)
{   
    fe25519 v1, v2, v3, v4;

    fe25519_mul(&v1, x, z1); 
    fe25519_add(&v2, x1, &v1);
    fe25519_sub(&v3, x1, &v1);
    fe25519_square(&v3, &v3);
    fe25519_mul(&v3, &v3, x2);

    fe25519_add(&v1, &CON486662, &CON486662);
    fe25519_mul(&v1, &v1, z1);
    fe25519_add(&v2, &v2, &v1);
    fe25519_mul(&v4, x, x1); 
    fe25519_add(&v4, &v4, z1);
    fe25519_mul(&v2, &v2, &v4);

    fe25519_mul(&v1, &v1, z1);
    fe25519_sub(&v2, &v2, &v1);
    fe25519_mul(&v2, &v2, z2);
    fe25519_sub(y1, &v2, &v3);
    fe25519_add(&v1, y, y);
    
    fe25519_mul(&v1, &v1, z1);
    fe25519_mul(&v1, &v1, z2);
    fe25519_mul(x1, &v1, x1);
    fe25519_mul(z1, &v1, z1);
}

static int
computeY_curve25519_affine(fe25519* y ,const fe25519* x) {
    // y^2 = x^3 + 486662x^2 + x
    fe25519 tmp, x2;

    // x^3
    fe25519_square(&x2, x);
    fe25519_mul(&tmp, &x2, x);
    // 486662x^2
    fe25519_mul(&x2, &x2, &CON486662);

    fe25519_add(&tmp, &tmp, &x2);
    fe25519_add(&tmp, &tmp, x);

    return fe25519_squareroot(y, &tmp);
}

/* This function should be used by use to set his key */
void set_static_key_curve25519(
    const uint8_t* uRx,
    const uint8_t* uRy,
    const uint8_t* uRz,
    const uint8_t* uSx,
    const uint8_t* uSy,
    const uint8_t* uSz,
    const uint8_t* ustatic_key,
    const uint8_t* ublindingFactor
) 
{
    uint8_t i;
    for (i = 0; i < 32; i++)
    {
        Rx.as_uint8_t [i] = uRx[i];
        Ry.as_uint8_t [i] = uRy[i];
        Rz.as_uint8_t [i] = uRz[i];
        Sx.as_uint8_t [i] = uSx[i];
        Sy.as_uint8_t [i] = uSy[i];
        Sz.as_uint8_t [i] = uSz[i];
        static_key.as_uint8_t [i] =  ustatic_key[i];
        blindingFactor.as_uint8_t [i] = ublindingFactor[i];
    }
    update_static_key_curve25519();
}

void update_static_key_curve25519() {
    // Update points R, S
    point25519 R, S;
    R.x = &Rx; R.y = &Ry; R.z = &Rz;
    S.x = &Sx; S.y = &Sy; S.z = &Sz;
    point25519 R0, S0;
    fe25519 rx0, ry0, rz0, sx0, sy0, sz0;
    R0.x = &rx0; R0.y = &ry0; R0.z = &rz0;
    S0.x = &sx0; S0.y = &sy0; S0.z = &sz0;
    fe25519_cpy(R0.x, R.x);
    fe25519_cpy(R0.y, R.y);
    fe25519_cpy(R0.z, R.z);
    fe25519_cpy(S0.x, S.x);
    fe25519_cpy(S0.y, S.y);
    fe25519_cpy(S0.z, S.z);

    uint8_t randbyte;
    randombytes(&randbyte, 1);
    int8_t nextBit = 7;
    while(nextBit >=0) {
        curve25519_doublePoint(&R, &R);
        curve25519_doublePoint(&S, &S);
        if(randbyte & (1 << nextBit)) {
            curve25519_addPoint(&R, &R, &R0);
            curve25519_addPoint(&S, &S, &S0);
        }
        nextBit--;
    }

#ifdef UPDATABLE_STATIC_SCALAR
   	sc25519 newBlindingFactor, newBlindingFactorInverse;
    fe25519_setzero(&newBlindingFactor);
   	randombytes(newBlindingFactor.as_uint8_t, 8);
    fe25519 t, randB;
    UN_512bitValue randVal;
    randombytes(randVal.as_uint8_t, 64);
    fe25519_reduceTo256Bits(&randB, &randVal);
    sc25519_mul(&t, &newBlindingFactor, &randB);
    sc25519_inverse(&t, &t);
    sc25519_mul(&newBlindingFactorInverse, &t, &randB);
    sc25519_mul(&static_key, &static_key, &newBlindingFactorInverse);
    sc25519_mul(&static_key, &static_key, &blindingFactor);
    cpy_256bitvalue(&blindingFactor, &newBlindingFactor);
#endif
}


#if (defined(__clang__) || defined(__GNUC__)) && defined (CORTEX_M4)

#define INCREMENT_BY_NINE(stackVariable) { \
 uint32_t scratchReg; \
 uint32_t ptrReg = (uint32_t) &stackVariable; \
    asm volatile ( \
        "LDR %[sr], [%[pr]] \n\t" \
        "add %[sr], %[sr], #9 \n\t" \
        "STR %[sr], [%[pr]]" \
            : [sr] "+r" (scratchReg), \
              [pr] "+r" (ptrReg) \
            : \
            : "memory"); \
}

#define INCREMENT_BY_163(stackVariable) { \
 uint32_t scratchReg; \
 uint32_t ptrReg = (uint32_t) &stackVariable; \
    asm volatile ( \
        "LDR %[sr], [%[pr]] \n\t" \
        "add %[sr], %[sr], #163 \n\t" \
        "STR %[sr], [%[pr]]" \
            : [sr] "+r" (scratchReg), \
              [pr] "+r" (ptrReg) \
            : \
            : "memory"); \
}

#else

#define INCREMENT_BY_NINE(a) { a += 9; }

