sca-secure-library-sca25519/sca25519/STM32F407-static/crypto/scalarmult/scalarmult_25519.c
#define INCREMENT_BY_163(a) { a += 163; }

#endif

int
crypto_scalarmult_curve25519(
    uint8_t*       r,
    /*const uint8_t* s,*/
    const uint8_t* p
)
{
    ST_curve25519ladderstepWorkingState state;
    uint8_t i;
    volatile uint32_t retval = -1;
    volatile uint32_t fid_counter = 0; // for fault injection detection

    // Initialize return value with random bits
    randombytes(r, 32);

    // Prepare the scalar within the working state buffer.
    for (i = 0; i < 32; i++)
    {
        state.s.as_uint8_t [i] = static_key.as_uint8_t [i];
        INCREMENT_BY_NINE(fid_counter);
    }

    // Copy the affine x-axis of the base point to the state.
    fe25519_unpack (&state.x0, p);

    fe25519_setone(&state.xq);
    fe25519_setzero(&state.zq);
    fe25519_cpy(&state.xp, &state.x0);
    fe25519_setone(&state.zp);

    INCREMENT_BY_NINE(fid_counter);

    fe25519 yp, y0;

    point25519 P, R;
    P.x = &state.xp; P.y = &yp; P.z = &state.zp;
    R.x = &Rx; R.y = &Ry; R.z = &Rz;

    if(computeY_curve25519_affine(&yp, &state.x0) != 0) {
    	goto fail;
    }
    curve25519_addPoint(&P, &P, &R);

    // Double 3 times before we start
    curve25519_doublePoint(&P, &P);
    curve25519_doublePoint(&P, &P);
    curve25519_doublePoint(&P, &P);

    // Randomize scalar multiplicatively
    UN_512bitValue randVal;
#ifdef SCALAR_RANDOMIZATION
    fe25519 t, Rinv, randB;
    fe25519_setzero((fe25519*) &state.r);
    randombytes(state.r.as_uint8_t, 8);
    randombytes(randVal.as_uint8_t, 64);
    fe25519_reduceTo256Bits(&randB, &randVal);
    
    sc25519_mul(&t, &state.r, &randB);
    sc25519_inverse(&t, &t);

    sc25519_mul(&Rinv, &t, &randB);
    sc25519_mul(&state.s, &state.s, &Rinv);
#else
    fe25519_setone((fe25519*) &state.r);
#endif

    /* new re-rand */
    sc25519_mul(&state.s, &state.s, &blindingFactor);

    INCREMENT_BY_163(fid_counter);

    // Optimize for stack usage.
    fe25519_invert_useProvidedScratchBuffers (&state.zp, &state.zp, &state.xq, &state.zq, &state.x0);
    fe25519_mul(&state.xp, &state.xp, &state.zp);
    fe25519_reduceCompletely(&state.xp);
    
    fe25519_mul(&yp, &yp, &state.zp);

    fe25519_cpy(&state.x0, &state.xp);

    // Reinitialize coordinates
    // Prepare the working points within the working state struct.
    randombytes(randVal.as_uint8_t, 64);
    fe25519_reduceTo256Bits(&state.zq, &randVal);
    // paranoia: guarantee that the value is not zero mod p25519
    fe25519_reduceCompletely(&state.zq);
    state.zq.as_uint8_t[31] |= 128;
    
    fe25519_mul (&state.xq, &state.zq, &state.x0);

    fe25519_setone(&state.xp);
    fe25519_setzero(&state.zp);

    state.nextScalarBitToProcess = 253;//252;

    // Prepare scalar xor previous bit. Always operate on
    // at least 16 scalar bits together.
    for(i=7;i>=1;i--)
    {
        uint32_t word = state.s.as_uint32_t[i];
        uint32_t previousWord = state.s.as_uint32_t[i-1];
        uint32_t temp = (word << 1) ^ word;

    	state.s.as_uint16_t[2 * i + 1] = temp >> 16;
        word = (word << 16) | (previousWord >> 16);

        word ^= (word << 1);
    	state.s.as_uint16_t[2 * i] = word >> 16;
    }
    state.s.as_uint32_t[0] ^= state.s.as_uint32_t[0] << 1;

#ifdef ITOH_COUNTERMEASURE
    UN_256bitValue itoh;
    randombytes(itoh.as_uint8_t,32); 
    itoh.as_uint8_t [31] &= 63;//31;//15

    UN_256bitValue itohShift;
    cpy_256bitvalue (&itohShift, &itoh);

    itohShift.as_uint32_t[7] <<= 1;
    for(i=7; i>=1; i--) {
        uint32_t overflow;
        overflow = ((itohShift.as_uint32_t[i-1] & (1 << 31)) >> 31);
        itohShift.as_uint32_t[i] |= overflow;
        itohShift.as_uint32_t[i-1] <<= 1;

        state.s.as_uint32_t[i] ^= itoh.as_uint32_t[i];
    }
    state.s.as_uint32_t[0] ^= itoh.as_uint32_t[0];
#endif

#ifdef MULTIPLICATIVE_CSWAP
#else
    state.s.as_uint32_t[7] <<= 2;//3;
#ifdef ITOH_COUNTERMEASURE
    itoh.as_uint32_t[7] <<= 2;//3;
    itohShift.as_uint32_t[7] <<= 1;//3;
#endif
#endif

    INCREMENT_BY_163(fid_counter);

#ifdef ITOH_COUNTERMEASURE
#ifdef MULTIPLICATIVE_CSWAP
    maskScalarBitsWithRandomAndCswap (&state, itohShift.as_uint32_t[7], 30);
#else
    curve25519_cswap_asm(&state, &itohShift.as_uint32_t[7]);
#endif
#endif

    while (state.nextScalarBitToProcess >= 0)
    {
        uint8_t limbNo = 0;
        uint8_t bitNo = 0;
#ifdef MULTIPLICATIVE_CSWAP
        {
          limbNo = (uint8_t)(state.nextScalarBitToProcess >> 5);
          bitNo = state.nextScalarBitToProcess & 0x1f;
          maskScalarBitsWithRandomAndCswap (&state,state.s.as_uint32_t[limbNo],bitNo);
        }
#else
        {
          limbNo = (uint8_t)(state.nextScalarBitToProcess >> 5);
#ifdef ITOH_COUNTERMEASURE
          uint32_t temp = state.s.as_uint32_t[limbNo] ^ itoh.as_uint32_t[limbNo];
          curve25519_cswap_asm(&state, &temp);
          state.s.as_uint32_t[limbNo] <<= 1;
          itoh.as_uint32_t[limbNo] <<= 1;
#else 
          curve25519_cswap_asm(&state, &state.s.as_uint32_t[limbNo]);
#endif
        }
#endif
        if (state.nextScalarBitToProcess >= 1)
        { 
          curve25519_ladderstep(&state);

          INCREMENT_BY_NINE(fid_counter);

#ifdef MULTIPLICATIVE_CSWAP
#ifdef ITOH_COUNTERMEASURE
          maskScalarBitsWithRandomAndCswap (&state, itohShift.as_uint32_t[limbNo], bitNo);
#endif
#else 
#ifdef ITOH_COUNTERMEASURE
          curve25519_cswap_asm(&state, &itohShift.as_uint32_t[limbNo]);
#endif
#endif
        }

        state.nextScalarBitToProcess --;
    }

    // ----------------------------------------------------------

    SCS_DEMCR |= SCS_DEMCR_TRCENA;
    DWT_CYCCNT = 0;
    DWT_CTRL |= DWT_CTRL_CYCCNTENA;
    unsigned int oldcount = DWT_CYCCNT;

    computeY_curve25519_projective(&y0, &state.xp, &state.zp, &state.xq, &state.zq, &state.x0, &yp);

    // Short scalar multiplication to undo multiplicative scalar blinding
    // Optimize for stack usage.
    fe25519_invert_useProvidedScratchBuffers (&state.zp, &state.zp, &state.xq, &state.zq, &state.x0);
    fe25519_mul(&state.xp, &state.xp, &state.zp);
    fe25519_reduceCompletely(&state.xp);


    fe25519_mul(&y0, &y0, &state.zp);
    fe25519_cpy(&state.x0, &state.xp);

