sca-secure-library-sca25519/sca25519/STM32F407-static/crypto/scalarmult/scalarmult_25519.c
    // Reinitialize coordinates
    // Prepare the working points within the working state struct.
    randombytes(randVal.as_uint8_t, 64);
    fe25519_reduceTo256Bits(&state.zq, &randVal);
    // paranoia: guarantee that the value is not zero mod p25519
    fe25519_reduceCompletely(&state.zq);
    state.zq.as_uint8_t[31] |= 128;
    
    fe25519_mul (&state.xq, &state.zq, &state.x0);

    fe25519_setone(&state.xp);
    fe25519_setzero(&state.zp);

    state.nextScalarBitToProcess = 64;
#if 1
    // Prepare scalar xor previous bit
	for(i=2;i>=1;i--){
		uint32_t tmp = state.r.as_uint32_t[i] << 1;
		tmp |= state.r.as_uint32_t[i-1] >> 31;
		state.r.as_uint32_t[i] ^= tmp;
	}

    state.r.as_uint32_t[0] ^= state.r.as_uint32_t[0] << 1;
#else
    // Prepare scalar xor previous bit. Always operate on
    // at least 16 scalar bits together.
    for(i=2;i>=1;i--)
    {
        uint32_t word = state.r.as_uint32_t[i];
        uint32_t previousWord = state.r.as_uint32_t[i-1];
        uint32_t temp = (word << 1) ^ word;

    	state.r.as_uint16_t[2 * i + 1] = temp >> 16;
        word = (word << 16) | (previousWord >> 16);

        word ^= (word << 1);
    	state.r.as_uint16_t[2 * i] = word >> 16;
    }
    state.r.as_uint32_t[0] ^= state.r.as_uint32_t[0] << 1;
#endif

#ifdef ITOH_COUNTERMEASURE64
    UN_256bitValue itoh64;
    fe25519_setzero((fe25519*) &itoh64);
    randombytes(itoh64.as_uint8_t,12); 
    itoh64.as_uint8_t [2] &= 1;

    UN_256bitValue itoh64Shift;
    cpy_256bitvalue (&itoh64Shift, &itoh64);

    itoh64Shift.as_uint32_t[2] <<= 1;
    for(i=2; i>=1; i--) {
        uint32_t overflow;
        overflow = ((itoh64Shift.as_uint32_t[i-1] & (1 << 31)) >> 31);
        itoh64Shift.as_uint32_t[i] |= overflow;
        itoh64Shift.as_uint32_t[i-1] <<= 1;

        state.r.as_uint32_t[i] ^= itoh64.as_uint32_t[i];
    }
    state.r.as_uint32_t[0] ^= itoh64.as_uint32_t[0];
#endif

#ifdef MULTIPLICATIVE_CSWAP
#else
    state.r.as_uint32_t[2] <<= 31;
#ifdef ITOH_COUNTERMEASURE64
    itoh64.as_uint32_t[2] <<= 31;
    itoh64Shift.as_uint32_t[2] <<= 30;
#endif
#endif

    INCREMENT_BY_163(fid_counter);

#ifdef ITOH_COUNTERMEASURE64
#ifdef MULTIPLICATIVE_CSWAP
    maskScalarBitsWithRandomAndCswap (&state, itoh64Shift.as_uint32_t[2], 1);
#else
    curve25519_cswap_asm(&state, &itoh64Shift.as_uint32_t[2]);
#endif
#endif

    while (state.nextScalarBitToProcess >= 0)
    {
        uint8_t limbNo = 0;
        uint8_t bitNo = 0;

#ifdef MULTIPLICATIVE_CSWAP
        {
          limbNo = (uint8_t)(state.nextScalarBitToProcess >> 5);
          bitNo = state.nextScalarBitToProcess & 0x1f;

          maskScalarBitsWithRandomAndCswap (&state,state.r.as_uint32_t[limbNo],bitNo);
        }
#else
        {
          limbNo = (uint8_t)(state.nextScalarBitToProcess >> 5);
#ifdef ITOH_COUNTERMEASURE64
          uint32_t temp = state.r.as_uint32_t[limbNo] ^ itoh64.as_uint32_t[limbNo];
          curve25519_cswap_asm(&state, &temp);
          state.r.as_uint32_t[limbNo] <<= 1;
          itoh64.as_uint32_t[limbNo] <<= 1;
#else 
          curve25519_cswap_asm(&state, &state.r.as_uint32_t[limbNo]);
#endif
        }
#endif

        if (state.nextScalarBitToProcess >= 1)
        {
           curve25519_ladderstep(&state);
           INCREMENT_BY_NINE(fid_counter);

#ifdef MULTIPLICATIVE_CSWAP
#ifdef ITOH_COUNTERMEASURE64
           maskScalarBitsWithRandomAndCswap (&state, itoh64Shift.as_uint32_t[limbNo], bitNo);
#endif
#else 
#ifdef ITOH_COUNTERMEASURE64
           curve25519_cswap_asm(&state, &itoh64Shift.as_uint32_t[limbNo]);
#endif
#endif
        }
        state.nextScalarBitToProcess --;
    }


    unsigned int newcount = DWT_CYCCNT-oldcount;
    char str[100];
    sprintf(str, "Cost additional 64-bits: %d", newcount);
    send_USART_str((unsigned char*) str);
    // ----------------------------------------------------------
    // Compute y1
    computeY_curve25519_projective(&yp, &state.xp, &state.zp, &state.xq, &state.zq, &state.x0, &y0);

    point25519 A;
    fe25519 Ay;
    A.x = &Sx; A.y = &Ay; A.z = &Sz;
    P.x = &state.xp; P.y = &yp; P.z = &state.zp;
    fe25519_cpy(A.y, &Sy);
    fe25519_neg(A.y, A.y);
    curve25519_addPoint(&P, &P, &A);

    // Optimize for stack usage.
    fe25519_invert_useProvidedScratchBuffers (&state.zp, &state.zp, &state.xq, &state.zq, &state.x0);    
    fe25519_mul(&state.xp, &state.xp, &state.zp);
    fe25519_reduceCompletely(&state.xp);
    INCREMENT_BY_163(fid_counter);

    if(fid_counter != (4 * 163 + 350 * 9)) {
fail:
    	retval = -1;
    	randombytes(state.xp.as_uint8_t, 32);
    } else {
    	retval = 0;
    }
    fe25519_pack (r, &state.xp);

    //update the key and the secret state data
    update_static_key_curve25519();
    return retval;
}

const uint8_t g_basePointCurve25519[32] =
{
    9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
};

int
crypto_scalarmult_base_curve25519(
    uint8_t*       q
    //const uint8_t* n
)
{
    return crypto_scalarmult_curve25519(q, /*n,*/ g_basePointCurve25519);
}

void cycles_cswap() {
    SCS_DEMCR |= SCS_DEMCR_TRCENA;
    DWT_CYCCNT = 0;
    DWT_CTRL |= DWT_CTRL_CYCCNTENA;

    ST_curve25519ladderstepWorkingState state;
    uint32_t wordwithbit = 10;
    uint32_t bitnum = 10;

    int i;
    unsigned int oldcount = DWT_CYCCNT;
    for (i = 0; i < 100; i++) {
      maskScalarBitsWithRandomAndCswap(&state, wordwithbit, bitnum);
    }
    unsigned int newcount = DWT_CYCCNT-oldcount;

    char str[100];
    sprintf(str, "Cost cswap: %d", newcount / 100);
    send_USART_str((unsigned char*) str);
}
